{
  plugins.snacks = {
    enable = true;
    settings = {
      bigfile = {
        enabled = true;
      };
      dashboard = {
        enabled = true;
        preset = {
          header = ''
            ███████████            ████  ████          █████   █████  ███                 
            ░░███░░░░░███          ░░███ ░░███         ░░███   ░░███  ░░░                 
            ░███    ░███  ██████   ░███  ░███   █████  ░███    ░███  ████  █████████████  
            ░██████████  ░░░░░███  ░███  ░███  ███░░   ░███    ░███ ░░███ ░░███░░███░░███ 
            ░███░░░░░███  ███████  ░███  ░███ ░░█████  ░░███   ███   ░███  ░███ ░███ ░███ 
            ░███    ░███ ███░░███  ░███  ░███  ░░░░███  ░░░█████░    ░███  ░███ ░███ ░███ 
            ███████████ ░░████████ █████ █████ ██████     ░░███      █████ █████░███ █████
            ░░░░░░░░░░░   ░░░░░░░░ ░░░░░ ░░░░░ ░░░░░░       ░░░      ░░░░░ ░░░░░ ░░░ ░░░░░'';

          keys = [
            {
              icon = " ";
              key = "f";
              desc = "Find File";
              action = ":lua Snacks.dashboard.pick('files')";
            }
            {
              icon = " ";
              key = "n";
              desc = "New File";
              action = ":ene | startinsert";
            }
            {
              icon = " ";
              key = "g";
              desc = "Find Text";
              action = ":lua Snacks.dashboard.pick('live_grep')";
            }
            {
              icon = " ";
              key = "r";
              desc = "Recent Files";
              action = ":lua Snacks.dashboard.pick('oldfiles')";
            }
            {
              icon = " ";
              key = "H";
              desc = "Check Health";
              action = ":checkhealth";
            }
            {
              icon = " ";
              key = "q";
              desc = "Quit";
              action = ":qa";
            }
          ];
        };
        sections = [
          { section = "header"; }
          { section = "keys"; }
        ];
      };
      explorer = {
        replace_netrw = true;
      };
      indent = {
        enabled = true;
      };
      notifier = {
        enabled = true;
      };
      picker = {
        win = {
          input = {
            keys = {
              "<a-c>" = [
                "toggle_cwd"
                {
                  mode = [
                    "n"
                    "i"
                  ];
                }
              ];
              "<a-s>" = [
                "flash"
                {
                  mode = [
                    "n"
                    "i"
                  ];
                }
              ];
              "s" = [ "flash" ];
              "<a-t>" = [
                "trouble_open"
                {
                  mode = [
                    "n"
                    "i"
                  ];
                }
              ];
            };
          };
        };
      };
    };
  };
}
