{
  plugins.snacks = {
    enable = true;
    settings = {
      dashboard = {
        enabled = true;
        preset = {
          header = ''
            ███████████            ████  ████          █████   █████  ███                 
            ░░███░░░░░███          ░░███ ░░███         ░░███   ░░███  ░░░                 
            ░███    ░███  ██████   ░███  ░███   █████  ░███    ░███  ████  █████████████  
            ░██████████  ░░░░░███  ░███  ░███  ███░░   ░███    ░███ ░░███ ░░███░░███░░███ 
            ░███░░░░░███  ███████  ░███  ░███ ░░█████  ░░███   ███   ░███  ░███ ░███ ░███ 
            ░███    ░███ ███░░███  ░███  ░███  ░░░░███  ░░░█████░    ░███  ░███ ░███ ░███ 
            ███████████ ░░████████ █████ █████ ██████     ░░███      █████ █████░███ █████
            ░░░░░░░░░░░   ░░░░░░░░ ░░░░░ ░░░░░ ░░░░░░       ░░░      ░░░░░ ░░░░░ ░░░ ░░░░░'';

          keys = [
            {
              icon = " ";
              key = "f";
              desc = "Find File";
              action = ":lua Snacks.dashboard.pick('files')";
            }
            {
              icon = " ";
              key = "n";
              desc = "New File";
              action = ":ene | startinsert";
            }
            {
              icon = " ";
              key = "g";
              desc = "Find Text";
              action = ":lua Snacks.dashboard.pick('live_grep')";
            }
            {
              icon = " ";
              key = "r";
              desc = "Recent Files";
              action = ":lua Snacks.dashboard.pick('oldfiles')";
            }
            {
              icon = " ";
              key = "q";
              desc = "Quit";
              action = ":qa";
            }
          ];
        };
        sections = [
          { section = "header"; }
          { section = "keys"; }
        ];
      };
    };
  };
}
